app/views/hours/_form.html.erb

SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = ? ORDER BY "clients"."name" ASC  [["user_id", 1]]
---
        <div class="col-sm-10">
          <%= form.collection_select :client_id, current_user.clients.order(:name),:id,:name, include_blank: true, class: 'form-control' %>