app/views/hours/index.html.erb

<%= render 'hours/hour_list' %>
<% if Client.where(user_id: current_user.id).exists? %>
---
SELECT  1 AS one FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]