app/views/invoices/_document_pdf.html.erb

                <td>
                    € <%= (hour.end_time - hour.start_time).to_i * ((User.find_by id: hour.user_id).tarif/3600)%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]