app/views/invoices/_invoice_pdf.html.erb

                                Invoice #: <%= @new_invoice.id %><br>
                                Created: <%= @new_invoice.created_at.to_date %><br>
---
INSERT INTO "invoices" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-12-12 12:39:35.572670"], ["updated_at", "2017-12-12 12:39:35.572670"]]

                <td>
                    € <%= (hour.end_time - hour.start_time).to_i * ((User.find_by id: hour.user_id).tarif/3600)%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]