app/views/invoices/index.html.erb

            <td>€ <%= invoice.total_amount %></td>
            <td><%= link_to "#{invoice.hours.first.client.name}", client_path(invoice.hours.first.client.name)%></td>
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "hours".* FROM "hours" WHERE "hours"."invoice_id" = ? ORDER BY "hours"."id" ASC LIMIT ?  [["invoice_id", 2], ["LIMIT", 1]]