app/views/clients/show.html.erb


<% if Client.where(user_id: current_user.id).exists? %>
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "clients" WHERE "clients"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]