app/controllers/clients_controller.rb

SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = ?  [["user_id", 1]]
---
  def index
    @clients = Client.where(user_id: current_user.id)

SELECT "hours".* FROM "hours" WHERE "hours"."user_id" = ? AND "hours"."client_id" = ?  [["user_id", 1], ["client_id", 1]]
---
  def show
    @hours = Hour.where(user_id: current_user.id, client_id: @client.id).to_a

INSERT INTO "clients" ("name", "codice_fiscale", "email", "partita_iva", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "a"], ["codice_fiscale", "a"], ["email", "a1@a.it"], ["partita_iva", 1], ["created_at", "2017-12-12 12:21:21.666987"], ["updated_at", "2017-12-12 12:21:21.666987"], ["user_id", 1]]
---
  def create
    @client = Client.new(client_params)
    @client.user_id = current_user.id

    respond_to do |format|
      if @client.save