app/controllers/hours_controller.rb

SELECT "hours".* FROM "hours" WHERE "hours"."user_id" = ? ORDER BY "hours"."date" ASC  [["user_id", 1]]
---
  def index
    @hours = Hour.where(user_id: current_user.id).order(:date)

SELECT  "clients".* FROM "clients" WHERE "clients"."user_id" IS NULL LIMIT ?  [["LIMIT", 1]]
INSERT INTO "hours" ("date", "start_time", "end_time", "description", "created_at", "updated_at", "user_id", "client_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @clients = Client.find_by_user_id(params[:user_id])
    @hour = Hour.new(hour_params)
    @hour.user_id = current_user.id

    respond_to do |format|
      if @hour.save

SELECT  "hours".* FROM "hours" WHERE "hours"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_hour
      @hour = Hour.find(params[:id])