app/controllers/invoices_controller.rb

  def index
    @hours = Hour.where(user_id: current_user.id).to_a
    @clients = Client.where(user_id: current_user.id).to_a
    invoices_hid = @hours.uniq.pluck(:invoice_id)
    @invoices = Invoice.where(id: invoices_hid)
---
SELECT "hours".* FROM "hours" WHERE "hours"."user_id" = ?  [["user_id", 1]]
SELECT "clients".* FROM "clients" WHERE "clients"."user_id" = ?  [["user_id", 1]]
SELECT "invoices".* FROM "invoices" WHERE "invoices"."id" IN (2, 2)

  def document
    @user = current_user
    @new_invoice = Invoice.find(params[:invoice])
    @hours_to_bill = Hour.where(invoice_id: @new_invoice.id).to_a
    @client = Client.find_by(id: @hours_to_bill.first.client_id)
---
SELECT  "invoices".* FROM "invoices" WHERE "invoices"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "hours".* FROM "hours" WHERE "hours"."invoice_id" = ?  [["invoice_id", 2]]
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def pdf
    if (params.has_key?(:hour_ids))
      client_id = (Hour.find_by id: params[:hour_ids].first).client_id
      params[:hour_ids].each do |value|
        hour = Hour.find_by id: value
        if client_id != hour.client_id
          redirect_to :controller => 'hours', :action => 'index', error_message: "You can't select two different clients in the same invoice. "
          return
        end
      end
      @new_invoice = Invoice.create
      params[:hour_ids].each do |value|
        @hour = Hour.find_by id: value
        @user = User.find_by id: @hour.user.id
        @client = Client.find_by id: @hour.client.id
        @hour.invoice_id = @new_invoice.id
        @new_invoice.total_amount += (@hour.end_time - @hour.start_time).to_i * (@user.tarif/3600)
        @hour.save if @hour.valid?
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "hours".* FROM "hours" WHERE "hours"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "invoices" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-12-12 12:39:35.572670"], ["updated_at", "2017-12-12 12:39:35.572670"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "hours" SET "invoice_id" = ?, "is_fatturata" = ?, "updated_at" = ? WHERE "hours"."id" = ?  [["invoice_id", 1], ["is_fatturata", "t"], ["updated_at", "2017-12-12 12:39:35.581432"], ["id", 1]]
UPDATE "invoices" SET "updated_at" = ?, "total_amount" = ? WHERE "invoices"."id" = ?  [["updated_at", "2017-12-12 12:39:35.586028"], ["total_amount", 0.06666666666666667], ["id", 1]]

    def set_invoice
      @invoice = Invoice.find(params[:id])
---
SELECT "invoices".* FROM "invoices" WHERE 1=0