app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "tarif", "street_name", "street_number", "postal_code", "city", "state") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)